#pragma once
#define DEFAULT_CONFIG R"({
    "host": "0.0.0.0",
    "port": 9444,
    "access_token": "",
    "client_salt": null,
    "public_address": null,
    "public_basepath": "/",
    "web_mode_hint": true,
    "super-admin": [],
    "black-list": [],
    "white_list_mode": false,
    "black-list-group": [],
    "white-list-group": [],
    "allow_bulk_private": false,
    "clan_battle_mode": "web",
    "notify_groups": [],
    "notify_privates": [],
    "preffix_on": false,
    "preffix_string": "",
    "zht_in": false,
    "zht_out": false,
    "zht_out_style": "s2t",
    "show_icp": false,
    "icp_info": "",
    "gongan_info": "",
    "web_gzip": 0,
    "boss_hp": {
        "cn": [
            [
                6000000,
                8000000,
                10000000,
                12000000,
                15000000
            ],
            [
                8000000,
                10000000,
                13000000,
                15000000,
                20000000
            ],
            [
                20000000,
                22000000,
                25000000,
                28000000,
                30000000
            ],
            [
                270000000,
                280000000,
                300000000,
                310000000,
                320000000
            ]
        ],
        "tw": [
            [
                6000000,
                8000000,
                10000000,
                12000000,
                15000000
            ],
            [
                8000000,
                10000000,
                13000000,
                15000000,
                20000000
            ],
            [
                20000000,
                22000000,
                25000000,
                28000000,
                30000000
            ],
            [
                270000000,
                280000000,
                300000000,
                310000000,
                320000000
            ]
        ],
        "jp": [
            [
                9000000,
                12000000,
                15000000,
                18000000,
                23000000
            ],
            [
                12000000,
                15000000,
                20000000,
                23000000,
                30000000
            ],
            [
                50000000,
                56000000,
                64000000,
                70000000,
                85000000
            ],
            [
                1160000000,
                1200000000,
                1240000000,
                1280000000,
                1320000000
            ]
        ]
    },
    "lap_range": {
        "cn": [
            [
                -2,
                -2
            ],
            [
                1,
                6
            ],
            [
                7,
                22
            ],
            [
                23,
                999
            ]
        ],
        "tw": [
            [
                -2,
                -2
            ],
            [
                1,
                6
            ],
            [
                7,
                22
            ],
            [
                23,
                999
            ]
        ],
        "jp": [
            [
                -2,
                -2
            ],
            [
                1,
                6
            ],
            [
                7,
                22
            ],
            [
                23,
                999
            ]
        ]
    },
    "boss_id": {
        "cn": [
            305700,
            304600,
            305102,
            313400,
            300201
        ],
        "tw": [
            305700,
            304600,
            305102,
            313400,
            300201
        ],
        "jp": [
            301204,
            316600,
            306404,
            304101,
            302701
        ]
    },
    "boss_name": {
        "cn": [
            "巨型哥布林",
            "雷雷",
            "巨型凶暴兔",
            "赤剑毒蛇",
            "利蝎巴鲁托"
        ],
        "tw": [
            "巨型哥布林",
            "雷雷",
            "巨型凶暴兔",
            "赤剑毒蛇",
            "利蝎巴鲁托"
        ],
        "jp": [
            "グレーターゴーレム",
            "ゴブリンライダー",
            "ワイルドクロウ",
            "ティタノタートル",
            "カルキノス"
        ]
    }
}
)"